{
  "SKU": "DUR192LZ-E-01731",
  "Title": "Makita DUR192LZ 18V LXT Brushless Grass Line Trimmer Strimmer Split Shaft + Line",
  "Price": 148.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_03/DUR192LZ-E-01731.jpg",
  "Description": "<div>The Makita DUR192LZ is a cordless grass trimmer designed for efficient and convenient trimming of small to medium-sized lawns. With its powerful motor, the DUR192LZ can easily cut through grass and weeds, ensuring a clean and tidy lawn every time. The trimmer features a telescopic shaft that can be adjusted to suit users of different heights, making it comfortable to use for extended periods of time.<br><br>One of the standout features of the DUR192LZ is its battery life. The trimmer is powered by a lithium-ion battery that can provide up to 60 minutes of continuous use on a single charge, giving users ample time to complete their trimming tasks without the need for constant recharging.<br><br>Another great feature of the DUR192LZ is its lightweight and compact design. Weighing just 2.6kg, the trimmer is easy to manoeuvre and can be used in tight spaces with ease. The trimmer also features an adjustable loop handle that provides a comfortable grip and allows for greater control during use.<br><br>The DUR192LZ also comes equipped with a range of safety features, including a guard that helps to protect users from flying debris and a safety switch that prevents accidental start-ups.</div><div>&nbsp;</div><div><strong>Features</strong></div><div>&nbsp;</div><div>Brushless motor<br>Loop handle<br>2 part shaft design to allow for compact storage and transporting<br>Battery protection circuit<br>Electronic current limiter for overload protection and electric brake<br>Soft start, constant speed control and electronic 2 speed selection<br>On board storage for hex wrench for fast and easy blade changes<br>Ideal for residential and public places<br>Spindle M10 x 1.25 L<br>For use with nylon cutting head only<br>Not compatible with G-Series batteries</div><div>Constant speed control<br></div><div>2-part shaft design allows for compact storage and transport<br>For use with nylon cutting head only</div><div>&nbsp;</div><div>Includes additional 15m of Line</div><div><div>The Four-Leaf shaped cord decreases the noise level. Therefore it is ideal for use with low noise cordless brush cutters &amp; line trimmers. Increased work amount per charge due to the Four-Leafed shape that has less air resistance than round nylon line.</div><div></div><div><strong>Features</strong></div><div><strong></strong></div><div>Ideal for use with low noise cordless brush cutters &amp; line trimmers<br>Increased work amount per charge</div></div><div>&nbsp;</div><div>&nbsp;</div><div><br></div>",
  "Id": "0298dcf4-2c78-492d-84b1-f2ef032dc4f9"
}