{
  "SKU": "4257980-12PCSET",
  "Title": "Einhell TC-RH 800 4F 240v SDS Plus 4 Mode Rotary Hammer Drill 800w + 12PC Set",
  "Price": 94.99,
  "QTY": 20,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/4257980-12PCSET-main.jpg",
  "Description": "<div><strong></strong><div>The Einhell TC-RH 800 4F rotary hammer is a powerful 800 W helper with four basic functions for restoration and renovation jobs: drilling, impact drilling and chiseling with and without lock. Rotary hammers are used whenever the going gets tough. They hammer and drill into tough material such as stone and concrete. The impact pulses literally \"break down” the material, while the cutter eats into the material with its rotating movement and breaks it out. Rotary hammers are suitable for both demolition work and for pulling down or breaking off hard materials such as concrete, brick or stone. The rotary hammer delivers up to 2.6 joule to the tool and with its pneumatic impact mechanism it provides very good forward traction for a drilling capacity of up to 26 mm in concrete. There is a practical position switch for all functions, while the large soft grip surfaces ensure a firm hold and therefore safe handling. The rotary hammer is equipped with a continuous operation lock for comfortable and user-friendly operation and an SDS-plus tool chuck with semi-automatic function. For all its power, the electronic speed control ensures that the tool can be adjusted to each particular material and application, and for safety there is an overload slip coupling. The infinitely adjustable drilling depth stop is made of stable plastic. The product is supplied in a practical E-Box Basic transport and storage case.</div><div>&nbsp;</div><div></div><div><strong>Features</strong></div><div></div><div><br>4 functions: drilling/hammer drilling/chiselling with &amp; without fixing<br>Overload slipping clutch for increased user safety<br>One position switch for all functions<br>Large softgrip surfaces for comfortable working<br>Continuous running lock for pleasant and easy working.<br>Pneumatic impact mechanism for excellent propulsion<br>Robust SDS-plus tool holder with semi-automatic operation<br>Speed electronics for material- and application-appropriate work<br>Infinitely adjustable plastic drill depth stop</div><div><br>Comes in an E-Box Basic transport and storage case</div></div><div>&nbsp;</div><div><strong>Includes a 12 Piece SDS Set</strong><br><br>12-piece drill bit set for all rotary hammers with SDS Plus holder<br>3x drill bits: Total length 110 mm/length 60 mm: 1x Ø 5 mm, 2x Ø 6 mm<br>7x drill bits: Total length 160 mm/length 110 mm: 2x Ø 6 mm, 2x Ø 8 mm, 2x Ø 10 mm, 1x Ø 12 mm<br>1x drill bit: Total length 210 mm/length 160 mm: Ø 8 mm<br>1x drill bit: Total length 260 mm/length 210 mm: 1x Ø 14 mm</div><div>&nbsp;</div><div><br></div>",
  "StoreCategoryId": "e1e93154-d3a2-4054-96ba-f22236ebfce4",
  "Id": "07faef0f-02b6-4a66-b2b5-4772c5f659fa"
}