{
  "SKU": "4460640-ACC",
  "Title": "Einhell TC-OS 1520 1/3 Sheet Orbital Sander 150W 240V 230 x 93mm + Sanding Sheet",
  "Price": 32.99,
  "QTY": 19,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/4460640-ACC-MAIN.jpg",
  "Description": "<div><strong>Desciption For 4460640</strong><br><br>The Einhell TC-OS 1520 Orbital Sander is a high-quality, handy device that provides an even sanding finish. Fitted with a clamping device as well as a hook and loop fastener system making the abrasive pad selectable and changed easily and quickly. Because of its large, ergonomic gripping sections, it can be handled precisely to receive perfect sanding results. The practical vacuum adaptor allows direct connection of a vacuum cleaner for extraction of sanding dust.&nbsp;&nbsp;<br>Input Power: 150W<br>Oscillating Speed: 23,000/min.<br>Oscillating Circuit: 2mm<br>Base Size: 230 x 93mm<br>Weight: 1.1kg</div><div>&nbsp;</div><div><strong>Desciption For 49817985</strong><br><br>With the practical sanding strip set, large surfaces made of wood or metal can be processed quickly, precisely and cleanly. Thanks to perforation, the strips are suitable for use with a suction device. The Quick-Stick system allows tool-free change. Due to different grains, the right abrasive is available for every project. The sanding strips are suitable for all standard orbital sanders with Velcro backing plate. All sanding strips of the set have the dimensions 93 x 187 mm and an underlay made of e-paper with Velcro backing. Furthermore, the strips are two times fully resin-bonded. The abrasive is made of fine corundum and the strips are punched 8 holes (diameter 10 mm). </div><div>&nbsp;</div><div>The set contains 18 strips with three different grits, 5 x 60, 8 x 120 and 5 x 180 <br><div><br></div></div><div>&nbsp;</div><div>&nbsp;</div><div><br></div>",
  "StoreCategoryId": "e1e93154-d3a2-4054-96ba-f22236ebfce4",
  "Id": "1082684b-567d-4062-b5de-0de6c87e19d2"
}