{
  "SKU": "4466230-ACC",
  "Title": "Einhell TE-BS 8540 E Variable Speed Sander 75 x 533mm 850W 240V +6 Sanding Belts",
  "Price": 73.99,
  "QTY": 27,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/corded sande/4466230-ACC.jpg",
  "Description": "<div><strong>Desciption For 4466230<br></strong><br>The Einhell TE-BS 8540 E Belt Sander is fitted with speed electronics that ensure that the sanding power is adjusted exactly depending on the particular material and task. The highly exact belt position can be optimally set with the precision adjustment facility, while the sanding belt can be changed with just a twist of the wrist and without any tools.<br><br>The soft grip and the adjustable additional handle provide outstanding ergonomics and high user-friendliness. The front cover can be flipped up in order to get into hard-to-reach cavities. In the flipped-down state it acts as a front-end spacer, and in combination with the adjustable additional handle it ensures maximum flexibility.<br><br>For low-dust operation the belt sander is equipped with a dust extraction adaptor and a dust collection box. A cable clip for securing the wound-up cable with just a twist of the hand sees the TE-BS 8540 E neatly stored away after use.<br><br>One sanding belt is included so that you can begin work immediately.<br><br>Features<br><br>Easy &amp; quick sanding belt change thanks to locking lever<br>Speed electronics for material and application suitable working<br>Exact belt position thanks to precision adjustment<br>For flexible operation there is an additional adjustable handle<br>Both integrated and connection for external dust extraction</div><div>&nbsp;</div><div><strong>Desciption For 49912575</strong><br><br>BELT SANDER ACCESSORIES: The Einhell 5-piece sanding belt set is a practical accessory set for electric belt sanders<br><br>AN ORIGINAL EINHELL ACCESSORY: The sandpaper set is specifically suitable for the Einhell belt sanders TE-BS 850 E, TE-BS 8540 E<br>and TC-BS 8038<br><br>HIGH QUALITY SANDING BELT: The high-quality sanding sheets are suitable for efficient sanding of wood and metal surfaces in conjunction with a belt sander<br><br>5 PIECE SET: The set includes 5 sanding belts with coarse, medium and fine granulation (2 of each P40, P80 and 1x P120) for sanding wood materials, chipboard, metal, paint and varnish<br><br>SIZE: Each sanding belt is 75 mm wide and 533 mm long</div>",
  "Id": "1c71f808-a2a7-4380-af21-4d2a47c49068"
}