{
  "SKU": "3410901-2-2.5AHSC",
  "Title": "Einhell GE-LM 36/4in1 18v 36v Cordless Brushless High Reach Multi Tool 2 x 2.5ah",
  "Price": 319.99,
  "QTY": 9,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/3410901-2-2.5AHSC.jpg",
  "Description": "<div><div>The Einhell GE-LM 36/4in1 Li cordless multifunction garden tool is a high-performance member of the flexible Power X-Change series from Einhell. Powered by two standard 18v Power X-Change batteries, the tool comes with interchangeable heads that enable it to be used as a brush cutter, line trimmer, tree pruner and hedge trimmer - while taking up far less storage space than four separate tools.<br><br>The power head has an energy efficient brushless motor that lasts longer than conventional carbon brush motors and also delivers more power. For the hedge trimmer function there are high-quality blades made of laser-cut and diamond-ground steel. For the pole-mounted pruner function there is a high-quality OREGON cutter rail and chain. Using the extension pole you can also trim high hedges and cut high branches. An oil tank ensures automatic lubrication of the chain during operation. The hedge trimmer head has 7 tilt settings, the trimmer line spool features automatic jog feed, and the multifunction tool also comes with a high-grade 3-tooth blade.<br><br>For user comfort, the tool has an adjustable auxiliary handle and is supplied with a shoulder harness.</div><div><p>The Einhell GE-LM 36/4in1 Li Multifunctional Tool is driven by a powerful, long-lasting brushless energy motor.&nbsp;Comes with 4 different attachments;&nbsp;<br></p><p>1 x Hedge Trimmer with 7 tilt settings and a laser-cut and diamond-ground steel blade.<br>1 x Brushcutter Attachment, this 3-tooth blade is made from laser-cut and diamond-ground steel.<br>1 x Pole Saw Attachment with a high-quality OREGON cutter rail and chain. An oil tank ensures automatic lubrication of the chain.<br>1 x Line Trimmer Spool Attachment with automatic jog feed.</p><p>Its also supplied with an extension pole for high hedges and branches, as well as an adjustable additional handle and harness.&nbsp;</p></div><p><strong>Features &amp; Benefits<br></strong><br>Cordless garden multi tool<br>Brush Cutter, Line Trimmer, Hedge Trimmer and Tree Pruner<br>Runs on two Power X-Change batteries<br>Brushless motor<br>Hedge trimmer blade made of laser-cut and diamond-ground steel<br>Hedge trimmer head tiltable by 7 settings<br>OREGON quality blade and chain<br>Oil tank for automatic chain lubrication<br>Single line spool with bump feed system<br>High-quality 3 tooth brush cutter blade<br>Additional adjustable handle<br>Extension pole for higher hedges and higher branches<br>Includes harness<br></p><p><strong>Includes</strong></p><p>2 x 2.5ah Batteries<br>2 x Chargers<br>GE-LM 36/4in1 Li-Solo Cordless Garden Multi Tool<br>Brush Cutter / Line Trimmer Head<br>Brush Cutter Blade<br>Spool and Line<br>Hedge Trimmer Head<br>Tree Pruner Head<br>Shoulder Harness</p><br></div>",
  "StoreCategoryId": "e1e93154-d3a2-4054-96ba-f22236ebfce4",
  "Id": "2590d9ab-5d8a-4f01-9fb8-df9468d4e4b0"
}