{
  "SKU": "4300805-BLADE",
  "Title": "Einhell TC-SM 2531/2 U 1900W Sliding Mitre Saw 254mm + Stand + 2 Blades ",
  "Price": 169.99,
  "QTY": 5,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/corded mitre/4300805-BLADE.jpg",
  "Description": "<div><strong></strong><div>The Einhell TC-SM 2531/2 U sliding mitre saw combines user-friendliness with precision on crosscuts and mitre cuts in workpieces made of wood, laminated panels and plastics. The high-quality turntable comes with an exact angle adjustment facility that can be latched single handedly in various positions. With a saw head that tilts to the left, the TC-SM 2531/2 U allows more complex cuts to be made at a wide range of angles. Supports for the sawing of long workpieces and the solid design of the clamping device ensure that the workpiece is held securely in position.<br><br>The TC-SM 2531/2 U comes with its own stand so it can be used at a comfortable standing height. A 48 tooth blade is also included, along with a dust bag.</div><div></div><div><strong>Description</strong></div><div></div><div>Underframe for stable standing and pleasant working height (84 cm)<br>Integrated pull function for wide workpieces up to 310 mm<br>The integrated laser enables fast, precise cuts<br>Rotary table with precise angle adjustment for oblique cuts<br>Tilting saw head to the left for mitre cuts<br>All settings are clearly visible from the working position<br>Supports left and right for machining long workpieces<br>Spindle lock for easy blade change<br><br>Base frame for stable stand and comfortable working height (84cm)<br>Laser guide for aligning the blade<br>Turntable with precise angle setting for angular cuts<br>Saw head tilts to the left for mitre cutting<br>Sliding function for wide work pieces up to 310 mm<br>Workpiece supports on both sides for long workpieces<br>All scales are perfectly visible from the working position<br>Spindle lock for easy blade change</div><div></div><div><strong>Includes</strong></div><div><strong></strong></div><div>TC-SM 2531/2 U Corded Electric Mitre Saw with Stand 240v<br>48 Tooth Blade<br>Workpiece Clamp<br>Dust Bag</div><div>&nbsp;</div><div>Includes an additonal Einhell Saw blade with 48 saw teeth, saw blade diameter 254 mm, drill diameter 30 mm, thickness 2.2 mm.</div></div>",
  "StoreCategoryId": "f6c00156-5170-42b4-96f5-19a996c13016",
  "Id": "3ad65e28-0dcf-4b82-9cd5-1950a307b492"
}