{
  "SKU": "DCD709N-32PCSET",
  "Title": "Dewalt DCD709N 18v XR Li-Ion Brushless Compact Combi Hammer Drill + 32pc Acc Set",
  "Price": 74.99,
  "QTY": 74,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/DCD709N-32PCSET.jpg",
  "Description": "<div>The Dewalt DCD709 Brushless Combi Drill is ideal for all uses, from professionals to DIYers. It is only 175mm in length allowing access to small spaces and lightweight at only 1.2kg for ease when using. The brushless motor means it can work with full power under load and its life span remains at its maximum. The built-in LED provides illumination in low visibility areas to ensure you can keep working in all different conditions. It includes a belt hook to free up the user's hands and help when transporting from job to job.</div><div>&nbsp;</div><div><strong>Features of the Dewalt DCD709:</strong><br><br>Only 175mm in length, allowing you to get in to even smaller spaces<br>Only 1.2Kg (tool only) for ultimate portability and ease of use<br>Efficient brushless motor delivers high performance, extends tool life and allows for a much shorter design<br>LED with delay feature for better workpiece illumination<br>15 position adjustable torque control for consistent screw driving into a variety of materials<br>65Nm torque allows you to achieve tough applications<br>Includes belt clip</div><div>&nbsp;</div><div>Bare unit - no battery or charger included<br><br>This set includes a 32pc Bit Set<br>&nbsp;<br>This 32 piece screwdriver bit set containing a range of driver bits for a variety of applications - all stored in a handy sized plastic carry case with a belt clip. This quick-release bit holder contains 30 25mm 'standard' screwdriver bits.<br>&nbsp;<br>Features<br>&nbsp;<br>Supplied in a plastic carry case with belt clip<br>Range of 25mm length screwdriver bits in labelled slots<br>Durable and robust construction bits<br><br>Includes<br><br>8x Pozi Drive Bits: 2x PZ1, 5x PZ2, 1x PZ3<br>3x Slotted Bits: 1x SL 4mm, 1x SL 5.5mm, 1x SL 6.5mm<br>7x Philips Bits: 2x PH1, 4x PH2, 1x PH3<br>12x Torx Bits: 2x T10, 2x T15, 2x T20, 3x T25, 2x T30, 1 x T40<br>1x Plastic Carry Case With Belt Clip<br></div><br>",
  "Id": "409cc644-767c-4738-a056-195ccb2933f6"
}