{
  "SKU": "4259825-22PCSET",
  "Title": "Einhell TC-ID 1000 E Impact Corded Power Drill + Metal Chuck 240v + 22PC Bit Set",
  "Price": 56.99,
  "QTY": 20,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/4259825-22pcset.jpg",
  "Description": "The Einhell TC-ID 1000E Impact Drill is suitable for DIY enthusiasts to use around the home and garage. A switch lets you select between the drilling and impact drilling functions. The sturdy full metal key chuck assures a safe fixing of the tool bit. With the integrated electronic controls the speed can be pre-selected and precisely adjusted.<p>The sturdy, adjustable drilling depth stop is made of metal and enables exact, repeat drilling depths. The reversing facility means that screwdriving jobs can also be performed. For user-friendly and safe operation of the machine there is a large soft grip area and an additional handle with an anti-twist lock.</p><div><strong>Description<br></strong></div><div>Sturdy full metal key chuck<br>Electronic speed control with speed pre-selection<br>Functions drilling and hammer drilling<br>Metal depth stop<br>Large softgrip area for convenient work</div> <p>Chuck: 13mm.<br>Input Power: 1,010W.<br>No Load Speed: 0-3,000/min.<br>Impact Rate: 0-48,000/bpm.<br>Capacity: Concrete 16mm, Steel 13mm, Wood 32mm.<br>Weight: 2.12kg.</p><div>&nbsp;</div><div>Includes a&nbsp;Einhell KWB 22 Piece HSS Drill and Screwdriver Bit Set</div><div><br>Part of the KWB by Einhell accessory range, this handy bit set contains most of the tools you'll need for driving screws as well as drilling and countersinking pilot holes. The ideal accompaniment for a corded or cordless drill, the set comes complete in a compact organiser case to keep everything secure during transport or storage.<br><br>Features &amp; Benefits<br>Part of the KWB by Einhell accessory range<br>Suitable for all standard corded or cordless hammer drills, drill drivers and combi drills<br>HSS drill bits for drilling into wood, metal and plastic<br>Countersink for setting screw heads flush with the material surface<br>Quick release bit holder for screwdriver bits<br>Includes 12 of the most commonly needed screwdriver bits in 25mm and 50mm lengths<br>Packaged in a compact carry case<br><div><br></div></div><div>Screwdriver Bit Holder<br>PZ2 Screwdriver Bit 25mm<br>PH2 Screwdriver Bit 25mm<br>T15 Screwdriver Bit 25mm<br>T20 Screwdriver Bit 25mm<br>T25 Screwdriver Bit 25mm (x2)<br>PZ2 Screwdriver Bit 50mm<br>PH2 Screwdriver Bit 50mm<br>T15 Screwdriver Bit 50mm<br>T20 Screwdriver Bit 50mm (x2)<br>T25 Screwdriver Bit 50mm<br>6mm Nut Driver<br>8mm Nut Driver<br>10mm Nut Driver<br>Countersink<br>3mm HSS Drill Bit<br>4mm HSS Drill Bit<br>5mm HSS Drill Bit<br>6mm HSS Drill Bit<br>8mm HSS Drill Bit<br>Carry Case</div><div><br></div>",
  "StoreCategoryId": "e1e93154-d3a2-4054-96ba-f22236ebfce4",
  "Id": "456a5436-59e7-4a48-a126-31ee88dc7e9c"
}