{
  "SKU": "4513950-2-4AHSC",
  "Title": "Einhell 18v 36V Power X-Change 18v Cordless SDS Hammer Drill HEROCCO 36/28 2x4ah",
  "Price": 299.99,
  "QTY": 5,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/cordless sds/4513950-1-4AH.jpg",
  "Description": "<div><strong>Desciption For 4513950</strong><br><br>The Einhell cordless rotary hammer Herocco 36/28 combines the drilling capacity of a pneumatic impact mechanism with the power of a TWIN-PACK operated Power X-Change device with two 18 V rechargeable batteries for 4 functions: Drilling, impact drilling, chiseling w/wo lock. The rotary hammer is equipped with: universal SDS-plus tool chuck with semi-automatic function, speed electronics and an overload safety stop, infinitely adjustable drilling depth stop made of metal and an LED. The tool is powered by the Einhell PurePOWER brushless motor for more power and longer running time. After online registration, the motor comes with a 10-year warranty. Enhanced handling comfort is ensured by the vibration-cushioned ergonomic main handle and additional handle with soft grip and ribs for secure fastening. Two 18 V Power X-Change rechargeable batteries, ideally 3.0 Ah or higher, are recommended.<br><br>A member of the Power X-Change family<br>Twin-Pack Technology: 2x18V Power X-Change batteries - more power<br>Brushless motor - more power and longer running time<br>PurePOWER Brushless - 10 year motor warranty after registration<br>High drilling performance with simultaneous wireless freedom<br>4 functions: Drilling/impact drilling/chiseling with and w/o lock<br>Overload safety stop for extra user safety</div><div>&nbsp;</div><div><div><strong>Includes&nbsp;</strong></div><div></div><div>2x 4.0ah Batteries</div><div>1x Charger</div></div><div>&nbsp;</div><div><strong>Desciption For X2 4511396&nbsp;</strong><br><br>Einhell Power X Change 18v Lithium Ion 4.0ah Battery<br><br>Power X-Change is the rechargeable battery system from Einhell. It is designed for multi functionality. With this advanced technology, you can use 18V rechargeable batteries with different capacity ratings to power any of the Einhell Power X Change range.<br><br>7-in-1 ABS: Active Battery Management System from Einhell.<br><br>No memory effect - the battery can be recharged at any time, even if it is only partially discharged.<br><br>No self discharging - always ready for immediate action even after being in storage for months.<br><br>Compact and light - significantly lighter than NiCd batteries allowing better handling.<br><br>Sophisticated charging technology - short charging time, optimum performance and maximum battery life.<br><br>Consistently high performance - delivers almost the same power at the end of the battery life as freshly charged ones.<br><br>3 x running time - compared to the conventional NiCd batteries.<br><br>3-step LED battery control.<br><br>Modern technology: Microprocessor controls permanently parameters.<br><br>Rubber-coated housing makes sure high impact protection and grip.</div><div>&nbsp;</div><div><strong>Desciption For X2 4514095&nbsp;</strong><br><br>18v 30 minute Power X-Change Charger for 1.5 Ah - 5.2Ah batteries<br><br>6-steps charging condition display with charging light indicator.<br><br>Ready for wall-fastening. Intelligent Charging-Management-System for long battery life.<br><br>Battery status will be constantly checked an accordant loaded.<br><br>Deeply discharged batteries will be charged in repair mode.<br><br>Fully compatible with both the 1.5Ah and 3.0Ah.<br><br>60 min Charge for 18v/3.0Ah Lithium Battery<br><br>30 min Charge for 18v/1.5Ah Lithium Battery</div><div>&nbsp;</div><div>&nbsp;</div>",
  "Id": "4658072b-90f5-427f-9fd2-e619f144b933"
}