{
  "SKU": "DAS180Z-MAKPAC",
  "Title": "Makita DAS180Z 18v Brushless Dust Blower Inflator Deflator LXT Nozzles + Makpac",
  "Price": 159.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/DAS180Z-MAKPAC.jpg",
  "Description": "<div>The Makita DAS180Z 18V Cordless Brushless Dust Blower, the perfect cordless power tool for a wide range of applications. Body Only Many uses from blowing dust &amp; debris away from from the work bench, tools or narrow spaces, cleaning other power tools and air filters of air conditioners among many uses in the workshop or job site + inflating and deflating inner tubes, play pools.With a powerful 18V brushless motor, this cordless dust blower from Makita can produce a powerful maximum air velocity of 200 m/s (with nozzle 7/mode 4), making it an efficient and effective tool for your cleaning needs + comes with a selection of nozzles.<br><br>Its net weight is only 1.2 kg, making it lightweight and easy to maneuver with a continuous runtime up to 55 x mins on low if using an optional 6.0Ah battery.<br><br>Comes with useful features such as a trigger lock function, a lock-on button, and variable speed control by trigger. It also boasts a 4-stage air volume that is selectable according to your application needs.<br><br>Additionally it features a one-touch nozzle replacement and an LED job light, making it user-friendly and convenient.<br><br>To ensure your safety and the longevity of the tool, the Makita DAS180Z comes equipped with an anti-restart function and a filter for preventing foreign materials from being sucked in.The tool-less attachment change makes it easy to switch between applications, and the vacuum / suction function (optional accessories required) adds versatility to this brand new tool from Makita.The vacuum / suction function on the Makita DAS180Z is suitable for deflating purposes only, not for use as a vacuum / dust extractor + additional optional accessories are required for this function.<br><br><br>Makita DAS180z Dust Brushless 18v Blower has a variety of tip nozzles, this model can meet a wide range of applications from professional use to home use, such as various blow-off works, filter cleaning, inflation and deflation of inflatable toys and more<br>Can also be used for deflating inner tubes, play pools and more, with Air vent hose (option) attached to the back of the machine<br><br>Main applications<br>Blow-off works<br>Inflation and deflation of inner tubes, play pool and more<br>Blowing dust away from OA equipment or narrow spaces (as an alternative item of air spray can)<br>Product maintenance (cleaning tools, removing mud from OPE products, etc.)<br>Cleaning air filters of air conditioners, etc<br>Removal of concrete dust when drilling pilot holes for anchors<br>One-touch nozzle replacement; Easy nozzle replacement without tool<br>LED job light with preglow and afterglow functions<br>Variable speed control by trigger<br>4 stage air volume; selectable according to your application<br>Hanging hole enables to hang the machine like a factory air duster<br>Filter for preventing foreign matter from being sucked in<br>Lock-on switch<br>Battery capacity warning function<br>Belt clip (option)</div><div>&nbsp;</div><div>Includes Makpac Case with Foam Inlay<br><br>Bare Unit - No Battery included - TOOL Only&nbsp;</div>",
  "Id": "4a2950cb-85bf-4808-b55a-55a601b4eebb"
}