{
  "SKU": "BSTOCK-A2",
  "Title": "Bosch GRT 18V-33 18V Professional Cordless Brushless Grass Trimmer Strimmer ",
  "Price": 234.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2023_10/06008D0000-main.jpg",
  "Description": "<div>The GRT 18V-33 Professional is a battery trimmer with a powerful, brushless motor for high performance, increased run time and longer life.<br><br>You can manually adjust the engine speed to current working conditions to optimize run time.</div><div><br>Electronic speed control keeps the speed constant to maintain even trimming performance.</div><div><br>The Bosch Anti-Tangle feature provides more even trimming, preventing jamming caused by long grass or weeds wrapped around the shaft.<br><br>The well-balanced, lightweight design and low noise level support effortless work.</div><div><br>The durable Pro-Tap system with EasyWind for quick wire feed provides a cutting diameter of 33 cm.</div><div><br>The plant protection bracket provides a neat finish at edges while protecting valuable trees and plants.<br><br>The GRT 18V-33 Professional is the perfect solution for trimming long grass in medium to large gardens and getting rid of weeds in the driveway.<br><br>It is compatible with all batteries and chargers in the Bosch Professional 18V System.<br><br>It is equipped with a durable, aluminum motor housing and comes with a practical shoulder strap.</div><div>&nbsp;</div><div><strong>User Benefits</strong></div><div><strong>&nbsp;</strong></div><div>High-performance grass trimmer for effortless working<br>Powerful, brushless motor supports high performance, more runtime, and a longer service life<br>Best work results thanks to its electronic regulation for constant cutting speed, even under load<br>Faster and uninterrupted trimming without blockages thanks to the Bosch Anti-Tangle feature<br>Well-balanced, lightweight design and low noise level support effortless working<br></div><div>&nbsp;</div><div><strong>Includes<br></strong><br>1 x shoulder strap F 016 L72 340<br></div><div>&nbsp;</div><div>Bare Tool - No Battery or Charger Supplied&nbsp;</div><br>",
  "Id": "58aff4aa-75ce-425a-b98c-8027bca3cf9b"
}