{
  "SKU": "BSTOCK-A17",
  "Title": "Wiha 40674 TorqueVario-S electric Screwdriver Set 14 Piece WHA40674",
  "Price": 144.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/bc2f034c-0841-4fff-9e00-38e24b9d45e4/img/WHA40674.jpg",
  "Description": "<div class=\"d1\"><p>The Wiha TorqueVario®-S electric Screwdriver System provides controlled screw tightening combined with safe use for electric installations. Both the screwdrivers and the slimBits undergo an individual piece test as per the international IEC 60900 standard, allowing users to work safely on live parts up to 1,000 V AC.</p> <p>This 14 Piece Set contains the following:</p> <p>1 x TorqueVario®-S electric Screwdriver Handle.&nbsp;Covers a wide variety of applications with a torque range between 0.8 and 5.0 Nm. A clearly audible, physically perceptible signal emitted when the torque is produced guarantees process safe torque mechanics, protecting against damage to materials and eliminating the need for retouching. With a release accuracy of ± 6%, the torque tool complies with EN ISO 6789 requirements. The insulated ClicFix bit holder guarantees a secure hold for 75 mm long slimBits thanks to mechanical blade locking.</p> <p>1 x Setting Tool with Long Handle 90mm.</p> <p>1 x SoftFinish® electric slimVario Screwdriver with bit holder.</p> <p>1 x TorqueVario-S electric Adaptor.</p> <p>3 x Slotted slimBit electric Blades: 2.5 x 75mm, 3.5 x 75mm &amp; 5.5 x 75mm.</p> <p>2 x Phillips slimBit electric Blades: PH1 x 75mm &amp; PH2 x 75mm.</p> <p>2 x Pozidriv slimBit electric Blades: PZ1 x 75mm &amp; PZ2 x 75mm.</p> <p>2 x PlusMinus/Pozidriv slimBit electric Blades: SL/PZ1 x 75mm &amp; SL/PZ2 x 75mm.</p> <p>1 x Folding Case. Made from high-grade, hard-wearing materials. All components are arranged practically so they are easy to identify.</p><div class=\"d2\"><div class=\"d3\">Wiha<div class=\"d4\">A01<div class=\"d5\">B0018</div></div></div></div></div>",
  "Id": "6cf73cc4-404b-4724-af9f-aebe5c6b4550"
}