{
  "SKU": "4340515-BLADE",
  "Title": "Einhell TC-TS 2225 U Corded Table Saw 254mm 2200W 240v + Stand + 2 Blades",
  "Price": 199.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/corded table/4340515-BLADE.jpg",
  "Description": "<div><strong></strong><div>The Einhell TC-TS 2225 U bench-type circular saw is a high-performance tool for performing precise and flexible work. The sturdy parallel stop with clamps on both sides enables longitudinal cuts to be performed, and for effortless angle cuts the angle stop or the tilting saw blade can be used. If a larger support surface is needed, there are pull-out side tables and a length extension at the back. The powerful motor is designed to handle major jobs as well, and it has an integrated soft start function for protecting both it and the fuses. Holders on the housing are practical features for holding the supplied stops and tools, the push stick and the power cable.</div><div>&nbsp;</div><div><strong>Features</strong></div><p></p><p>Sturdy parallel stop with double clamp for precise cuts<br>Featuring a soft start function: Protects the motor and fuses<br>Extremely powerful motor with plenty of reserves for tough jobs<br>Pull-out side tables and length extension for large workpieces<br>A cross stop which also serves as an angle stop (+/- 45°)<br>Supplied stops and tools have holders on the housing<br>Connection for dust extractor at the housing and saw blade cover<br>The sturdy underframe enables a pleasant working height (870 mm)<br>Plastic housing with integrated stabilising metal struts</p><div><strong>Includes</strong><br></div><div>&nbsp;</div><div>TC-TS 2225 U Table Saw 240v<br>Stand<br>48 Tooth Blade</div></div><div><strong>&nbsp;</strong></div><div>Includes an additonal 49912575&nbsp;Einhell Saw blade with 48 saw teeth, saw blade diameter 254 mm, drill diameter 30 mm, thickness 2.2 mm.</div><div><br></div>",
  "Id": "85ab7ae7-997f-4d81-9a66-325c79f92ffa"
}