{
  "SKU": "4020440-1-2.5AH",
  "Title": "Einhell Power X-Change 18v Cordless Portable Compressor TE-AC + 2.5AH Kit ",
  "Price": 146.22,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/corded air c/4020440-1-2.5AH.jpg",
  "Description": "<div><strong>Desciption For 4020440&nbsp;</strong><br><br>The Einhell TE-AC 36/8 Li OF Set-Solo battery pack compressor is part of the powerful Power X-Change family. The batteries with the high-quality lithium-ion battery cells can be combined with all members of the Power X-Change family. The cordless case compressor is a small but powerful helper for applications up to a maximum of 8 bar. This makes it suitable, for example, for the rapid inflation of bicycle, car and motorcycle tyres. Even demanding road bike tyres do not pose any problems for the battery case compressor thanks to its powerful pump. The ergonomic design and a practical handle ensure mobility and easy transport. The oil-free, service-free pump requires only low maintenance. A storage compartment for the compressed air hose is integrated in the housing. An additional storage box is provided for the adapters. The tyre inflation gauge can be conveniently stowed away on the housing. Included in the delivery are a 2.50-metre compressed air hose with quick coupling, an adapter for use as a blow gun as well as a tyre inflation gauge and a three-piece adapter set. <br><br><strong>Features</strong><br><br>Member of the Power X-Change family, 2x18V batteries necessary<br>Twin-Pack Technology: 2x18V Power X-Change batteries - more power<br>Oilfree, servicefree pump for little maintenance<br>Ergonomic design and handle for easy transport<br>For many applications up to 8 bar<br>Integrated storage compartment for the compressed air hose<br>Additional integrated storage box for adapters</div><div>&nbsp;</div><div><strong>Includes</strong><br>1 x 2.5ah Battery<br>1 x Charger</div>",
  "Id": "9a9ad5b4-f402-41f8-8ad8-8572ad3068fd"
}