{
  "SKU": "DCF809N-32PCSET",
  "Title": "Dewalt DCF809N 18v XR Brushless Compact Impact Driver Bare Tool + 32pc Bit Set",
  "Price": 69.99,
  "QTY": 150,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/DCF809N-32PC.jpg",
  "Description": "<div style=\"text-align: left;\"><font style=\"font-family: Arial;\">The Dewalt DCF809N 18V Brushless Impact Driver Bare Unit is ideal for professionals and DIYers alike. It is compact for hard to reach places and brushless to ensure maximum power under load. Designed with 3 LED's to provide optimum illumination in low visibility areas. For comfort for the user when in use this impact driver has an ergonomically designed handle that provides the tool with the correct weight distribution keeping the tool well balanced when in use. The removable belt hook comes in handy when needing two hands to adjust your position or to use another tool and as it is backed by a 3-year warranty you can have confidence in your tool. <br><br></font></div><div style=\"text-align: left;\"><font style=\"font-family: Arial;\"><strong>Features</strong><br><br>DeWalt Efficient brushless motor delivers high performance, extends tool life and allows for a much shorter design<br>Compact and lightweight Impact Driver designed to fit into tight areas</font></div><div style=\"text-align: left;\"><font style=\"font-family: Arial;\">Only 131mm in length, 1.0kg (tool only) in weight for ultimate portability<br>Ergonomic comfort grip handle provides ideal balance and tool control<br>'Drop and Load' 1/4\" hex chuck bit holder for one-handed operation<br>LED job light -&nbsp;Designed with 3 LED's<br>Up to 190Nm torque allows you to achieve tough applications<br>Variable speed control trigger</font></div><div style=\"text-align: left;\"><font style=\"font-family: Arial;\">&nbsp;</font></div><div style=\"text-align: left;\">Bare Tool - No Batteries or Charger Supplied</div><div style=\"text-align: left;\">&nbsp;</div><div style=\"text-align: left;\">Belt clip not included</div><div style=\"text-align: left;\"><font style=\"font-family: Arial;\">&nbsp;</font></div><div style=\"text-align: left;\"><font style=\"font-family: Arial;\"></font><div><div>This set includes a 32pc Bit Set</div><div>&nbsp;</div><div></div><div>This 32 piece screwdriver bit set containing a range of driver bits for a variety of applications - all stored in a handy sized plastic carry case with a belt clip. This quick-release bit holder contains 30 25mm 'standard' screwdriver bits.<br>&nbsp;<br><strong>Features</strong><br>&nbsp;<br>Supplied in a plastic carry case with belt clip<br>Range of 25mm length screwdriver bits in labelled slots<br>Durable and robust construction bits<br><br><strong>Includes</strong><br><br>8x Pozi Drive Bits: 2x PZ1, 5x PZ2, 1x PZ3<br>3x Slotted Bits: 1x SL 4mm, 1x SL 5.5mm, 1x SL 6.5mm<br>7x Philips Bits: 2x PH1, 4x PH2, 1x PH3<br>12x Torx Bits: 2x T10, 2x T15, 2x T20, 3x T25, 2x T30, 1 x T40<br>1x Plastic Carry Case With Belt Clip</div></div></div>",
  "Id": "c19a08e0-db8b-4782-ad5b-ad33872ad993"
}