{
  "SKU": "RP120SU_SB",
  "Title": "Salamander RP120SU SuperBooster Pack 2 x 3.6 Bar Single Impeller Shower Pump ",
  "Price": 593.95,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/shower pumps/RP80SU_SB.jpg",
  "Description": "<div>Salamander RP120SU SB 2 x 3.6 Bar Single Universal Whole House and Shower Pump ( SuperBooster Pack of 2) (RP120SU SB).<br><br>This SuperBooster pack includes two 3.6 bar, single ended, universal (negative head) pumps from the Right Pump range. The pumps can be used to ‘split’ a pumped installation, with one pump used to boost the cold water pressure and the other to boost the hot water pressure.<br><br>Like the other pumps in the Right Pump range, SuperBooster packs use centrifugal technology to increase the water pressure in a gravity fed system. This method of boosting the water pressure is quieter and more flow efficient than other methods, which makes Right Pumps the best option for whole house applications.<br><br>A SuperBooster pack offers a great option for large homes supplied by gravity fed system, as two individual pumps deliver higher pressures across hot and cold water compared to a twin pump.<br><br>It is recommended to use a SuperBooster pack in a gravity fed system where the hot or cold water will regularly be used individually, such as when supplying cold water to an electric shower, as this prevents extended periods of ‘closed head running’, which happens when only one side of the pump is used.<br><br>The SuperBooster pack also provides greater flexibility during installation compared to a twin pump, as the pumps can be located separately, allowing one pump to be located near the cold water tank and the other near to the hot water cylinder.<br><br>Boost hot and cold water individually with two single ended pumps.<br>Offers flexible solution so pumps can be located separately.<br>Suitable for gravity-fed, positve and negative head installations.<br>Delivers higher pressure compared to a twin pump.</div><div>&nbsp;</div><div>&nbsp;</div><div>The RP120SU Right Shower Pump Replaces the ESP120 CPV, ESP120CPV<br></div><div class=\"short-description\">The RP range of pumps from Salamander have been re-engineered from their already fantastic range of ESP, RHP, RSP &amp; RGP pumps to provide enhanced quality and reliability.</div><div class=\"short-description\"></div><br><div class=\"short-description\">The new benefits include a reduction in noise, the use of crossover technology to allow the former RSP shower only pumps to power the whole house, and the inclusion of a spiders web design to strengthen the plastic ends to further enhance strength, rigidity and reliability.</div><br>Right pumps form our premium product range here at Salamander Pumps, offering the most powerful performance. Utilising centrifugal force, they are quieter and more flow efficient than regenerative pumps. The universal versions also have added technology that protects the pump from the most common issues.<br><br>These pumps will boost hot and/or cold water supplies to thermostatic or manual mixer shower valves, supplying a wide range of shower types and shower heads, individual taps, cisterns and other bathroom and whole house applications. Options are available for boosting champagne spray, massage function and multiple body sprays too.<br><br>Suitable for use in a gravity fed system, positive head and universal (negative head) models are both available.<br><br>From just 45.5dBA, these shower pumps are also the quietest on the market. Independently tested against the competition equivalent, the RP50PT is the quietest shower pump available.<br><br>Quietest pumps in the range, most powerful pumps in the range, patented technology, AV couplers included.<br><br><strong>Features of the <strong>Salamander RP120SU Pump</strong></strong><br><br>For maintained pressure at higher flow rates, you need one of Salamanders Right Pump 3.6 bar shower pumps. The centrifugal impeller means these pumps offer an extra boost to your shower/system, and are quiet with it.<br><br>Discover Salamander Pumps Right Pump 120 SU pumps; formerly known as ESP120 CPV.<br><br>This premium 3.6 bar single ended pump will also quietly and efficiently boost the hot or cold water supplies to your shower, wash basin, bath and kitchen taps in a negative head or positive head gravity fed installation.<br><br><strong>Applications of the Salamander RP120SU Pump</strong><br><br>Bath<br>Combination boilers via cold water break tank<br>Conventional shower<br>Electric showers via cold water break tank<br>Massage function<br>Multi-function shower<br>Single/multipoint water heaters via cold water break tanks<br>Taps<br>Toilet Cistern<br>Unvented cylinders via a cold water break tank<br>Victorian can<br>Wash basin<br>Washing machine<br>Whole house appliances<br><br>",
  "Id": "d1f0909e-8f01-4425-ab26-5a45c6e7f980"
}