{
  "SKU": "4513950-2-2.5AHSC",
  "Title": "Einhell 18v 36V Power X-Change 18v Cordless SDS Hammer Drill HEROCCO 36/28 2x2.5",
  "Price": 279.99,
  "QTY": 5,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/cordless sds/4513950-1-2.5AH.jpg",
  "Description": "<div><strong>Desciption For 4513950</strong><br><br>The Einhell cordless rotary hammer Herocco 36/28 combines the drilling capacity of a pneumatic impact mechanism with the power of a TWIN-PACK operated Power X-Change device with two 18 V rechargeable batteries for 4 functions: Drilling, impact drilling, chiseling w/wo lock. The rotary hammer is equipped with: universal SDS-plus tool chuck with semi-automatic function, speed electronics and an overload safety stop, infinitely adjustable drilling depth stop made of metal and an LED. The tool is powered by the Einhell PurePOWER brushless motor for more power and longer running time. After online registration, the motor comes with a 10-year warranty. Enhanced handling comfort is ensured by the vibration-cushioned ergonomic main handle and additional handle with soft grip and ribs for secure fastening. <br><br>A member of the Power X-Change family<br>Twin-Pack Technology: 2x18V Power X-Change batteries - more power<br>Brushless motor - more power and longer running time<br>PurePOWER Brushless - 10 year motor warranty after registration<br>High drilling performance with simultaneous wireless freedom<br>4 functions: Drilling/impact drilling/chiseling with and w/o lock<br>Overload safety stop for extra user safety</div><div>&nbsp;</div><div><strong>Includes&nbsp;</strong></div><div>&nbsp;</div><div>2x 2.5ah Batteries</div><div>1x Charger</div><div>&nbsp;</div><div><strong>Desciption For x2 4511516&nbsp;</strong><br><br>The Einhell 18V 2,5 Ah Power X-Change Battery is a member of the multifunctional and completely interchangeable Power X-Change rechargeable battery system from Einhell.<br><br><br>The Power X-Change rechargeable batteries can be used universally for supplying power and endurance to every cordless tool from the entire garden and workshop product family.<br>The advantages to the customer are obvious: A single rechargeable battery and a single charger for all tools not only saves significant costs of buying, universal use also helps protect the environment and provides flexibility in the home and garden too.<br><br>It also eliminates the untidiness and chaos of having different rechargeable batteries and chargers for each separate tool.<br><br>The high-quality rechargeable battery resists the memory effect and the self-discharging normally associated with batteries, to deliver constant high power.<br><br>The 18V 2,5 Ah Power X-Change Battery is the ideal basic rechargeable battery from the Power X-Change family and is also suitable for TWIN-PACK use for 36 V applications.<br><br>The ABS process-controlled active battery management system has a microprocessor for permanently monitoring the battery parameters.<br>It therefore ensures maximum safety, optimum tool performance, maximum operating time and a maximum service life.<br><br>The current charge level can be checked on a 3-step LED display.<br><br>The housing is designed to be resistant to dust, corrosion and mechanical influences.<br><br>There is a trough handle to enable the battery to be removed from each tool with ease.</div><div>&nbsp;</div><div><strong>Desciption For x2 4514095</strong><br><br>18v 30 minute Power X-Change Charger for 1.5 Ah - 5.2Ah batteries<br><br>6-steps charging condition display with charging light indicator.<br><br>Ready for wall-fastening. Intelligent Charging-Management-System for long battery life.<br><br>Battery status will be constantly checked an accordant loaded.<br><br>Deeply discharged batteries will be charged in repair mode.<br><br>Fully compatible with both the 1.5Ah and 3.0Ah.<br><br>60 min Charge for 18v/3.0Ah Lithium Battery<br><br>30 min Charge for 18v/1.5Ah Lithium Battery</div><div>&nbsp;</div><div>&nbsp;</div>",
  "StoreCategoryId": "e1e93154-d3a2-4054-96ba-f22236ebfce4",
  "Id": "d5cccb82-7e70-4a8f-8dde-a28f8e8a6bc2"
}