{
  "SKU": "2347140-1-2.5AH",
  "Title": "Einhell 18v Power X-Change Cordless Wet And Dry Vacuum Cleaner TE-VC + 2.5AH Kit",
  "Price": 199.99,
  "QTY": 1,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/cordless vac/2347140-1-2.5AH.jpg",
  "Description": "<div><strong>Desciption For 2347140&nbsp;</strong><br><br>The Einhell TE-VC 36/30 Li S-Solo cordless wet and dry vacuum cleaner is a member of the Power X-Change family. For optimal use of the battery there are two speeds: ECO and BOOST. Both the 30 l stainless steel tank and the stainless steel telescopic tube (Ø 36 mm) are robust in design. The accessory holder for neat storage and water drain screw make it a practical product to use. The blow connection is for blow-cleaning hard-to-reach areas. Easy transportation is ensured by the large wheels and castors. The product is supplied with a heavy-duty plastic suction hose (Ø 36 mm, 2.5 m length) and a large combination nozzle for carpets and smooth flooring. <br><br>Member of the Power X-Change family, 2x18V batteries necessary<br>2 speeds (ECO/BOOST) for optimal battery use<br>High suction power with simultaneous cordless freedom<br>30l stainless steel tank, rust-proof and sturdy<br>Blow connection for blow-cleaning hard-to-reach areas<br>Large wheels and castors for easy transporting<br>Practical accessories holder for clean stowage and operations</div><div>&nbsp;</div><div><strong>Desciption For 4511516&nbsp;</strong><br><br>The Einhell 18V 2,5 Ah Power X-Change Battery is a member of the multifunctional and completely interchangeable Power X-Change rechargeable battery system from Einhell.<br><br><br>The Power X-Change rechargeable batteries can be used universally for supplying power and endurance to every cordless tool from the entire garden and workshop product family.<br>The advantages to the customer are obvious: A single rechargeable battery and a single charger for all tools not only saves significant costs of buying, universal use also helps protect the environment and provides flexibility in the home and garden too.<br><br>It also eliminates the untidiness and chaos of having different rechargeable batteries and chargers for each separate tool.<br><br>The high-quality rechargeable battery resists the memory effect and the self-discharging normally associated with batteries, to deliver constant high power.<br><br>The 18V 2,5 Ah Power X-Change Battery is the ideal basic rechargeable battery from the Power X-Change family and is also suitable for TWIN-PACK use for 36 V applications.<br><br>The ABS process-controlled active battery management system has a microprocessor for permanently monitoring the battery parameters.<br>It therefore ensures maximum safety, optimum tool performance, maximum operating time and a maximum service life.<br><br>The current charge level can be checked on a 3-step LED display.<br><br>The housing is designed to be resistant to dust, corrosion and mechanical influences.<br><br>There is a trough handle to enable the battery to be removed from each tool with ease.</div><div><strong>&nbsp;</strong></div><div><strong>Desciption For 4514095&nbsp;</strong><br><br>18v 30 minute Power X-Change Charger for 1.5 Ah - 5.2Ah batteries<br><br>6-steps charging condition display with charging light indicator.<br><br>Ready for wall-fastening. Intelligent Charging-Management-System for long battery life.<br><br>Battery status will be constantly checked an accordant loaded.<br><br>Deeply discharged batteries will be charged in repair mode.<br><br>Fully compatible with both the 1.5Ah and 3.0Ah.<br><br>60 min Charge for 18v/3.0Ah Lithium Battery<br><br>30 min Charge for 18v/1.5Ah Lithium Battery</div>",
  "StoreCategoryId": "007df457-afc8-414d-bca8-dc7999165ed0",
  "Id": "dc2f8035-afdb-439d-804b-63a4d3c484ff"
}