{
  "SKU": "4430840-DBSET",
  "Title": "Einhell TE-AG230 Angle Grinder 9\" 230mm 2000W 240V TE-AG Soft Start + 2 x Blades",
  "Price": 84.99,
  "QTY": 19,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/4430840-DBSET2.jpg",
  "Description": "<div><strong>Desciption For 4430840</strong><br><br>The Einhell TE-AG230 Angle Grinder is an affordable performance-driven DIY tool. The soft start facility ensures this powerful angle grinder provides a comfortable start-up for users, which eases into a robust and powerful grinding performance over a short period of time. This provides added safety and comfort for users.<br><br>The angle grinder TE-AG 230/2000 is a robust and powerful tool for real experts with exacting demands, which offers outstanding performance on challenging cutting, grinding and roughing jobs everywhere in the home, workshop and garage.<br><br>Its disk guard with quick-adjust facility can be adapted with just a twist of the hand to any task, while the spindle lock permits easy and speedy tool change. A soft start function ensures that the tool starts up smoothly and safely. The TE-AG 230/2000 is equipped with a long-lasting, robust metal gear head which ensures optimum power transmission and low-vibration running.<br>Thanks to the soft grip on both the main handle and the additional handle, the angle grinder offers comfortable handling of the tool. The additional handle can be secured in three different positions for exact adaptation to the particular workpiece, thus ensuring a perfect hold for safe and speedy operation. The cable clip for securing the wound-up cable with just a twist of the hand keeps the TE-AG 230/2000 neat and safe when stored away.<br>Suitable for the more difficult tasks, due to its powerful metal gearing system. Further benefits include the keyless disc guard adjustment for quick adjustment depending on the job, spindle lock and the 3-postitional front handle.<br><br>Features<br><br>Ergonomic plastic housing with soft grip and robust, long-lasting aluminium transmission head for the demanding building site use<br>Powerful 2,00 Watt performance with a constant speed of 6,500 revolutions per minute<br>Additional handle with soft grip for each task mountable in 3 positions<br>Practical spindle lock for a quick tool change and simple adjustment of the disk guard without tools<br>Innovative cable clip for fixing the wound cable</div><div>&nbsp;</div><div><strong>Desciption For 49797605</strong><br><br>Original Einhell 2-piece 230 mm diamond cutting disc set<br>Compatible with angle grinders with Ø 230 mm<br>Compatible with Einhell angle grinder TE-AG 230<br>Compatible with Einhell angle grinder TE-AG 230/2000<br>Dimensions Ø 230 x 1.8 mm and 22-mm bore<br>Extra thin diamond cutting discs for little material loss<br>Suitable for cutting tiles or travertin<br>Suitable for higher cutting performance in granite or concrete for example<br>Maximum revs per minute: 6,600 min^-1<br>Can be used with a circumferential speed of 80 m/s<br><br>Incl. 1x cutting disc with diamond sprinkled turbo edge<br>Incl. 1x cutting disc with diamond sprinkled segmented edge</div>",
  "Id": "e8c8d593-edce-4c96-836f-cb4e3d138489"
}