{
  "SKU": "DCL184ZOF-1-1.5AH",
  "Title": "Makita DCL184ZO 18v Olive Adventure LXT Brushless Vacuum Cleaner Blower +Battery",
  "Price": 129.99,
  "QTY": 86,
  "Image": "https://shared1.ad-lister.co.uk/UserImages/fad77979-26e2-4ede-9f39-bdb242f0c51d/Img/2024_02/DCL184ZOF-1-1.5AH.jpg",
  "Description": "<div>The Makita DCL184 is a simple but effective vacuum cleaner, with a compact and lightweight housing design optimised for cleaning car interior, as well as other spaces around your home or workspace. The long flexible hose can be extended to 1m, and the body of the vacuum cleaner includes storage for the hose when the machine is not in use, making it nice and tidy to put away. There's a push button switch with 3 stage power selection, and the bevelled handle at the end of the hose makes it perfect for those close, tricky to reach edges.<br><br>The one touch speed change functionality lets you start at high speed, move up to max speed and then change again to normal speed, so you can adapt the vacuum power to suit your requirements. There's a variety of special nozzles included, and the tool automatically stops when it or the battery is becoming overheated, ensuring safety. This vacuum is compatible with Makita's range of Li-Ion batteries.<br><br>This tool is supplied as body only - batteries and charger sold separately.<br><br><strong>Features</strong><br><br>Push button switch with 3 stage power selection<br>2 functions in one, convertible into blower<br>5.4kPa max sealed suction performance<br>Max 500mL tank capacity<br>Range of attachments for detailed cleaning<br>Battery capacity warning lamp<br>Bevelled hose handle<br>Hose storage for when not in use<br>Flexible 1m hose</div><div>&nbsp;</div><div>Includes <br>1 x 1.5ah Battery<br>1 x Charger</div><div><br>5 Filter Bags, 5 Attachments Inc Blower Nozzle + Shoulder Strap</div><div>&nbsp;</div><div><b>Part of the limited edition Makita Adventure&nbsp;Olive Green Range of 18v lxt outdoor and leisure tools</b><br><br><br></div><br>",
  "Id": "eb1d9e18-f038-4078-bfa1-de39aafa67b9"
}